Public Member Functions | List of all members
ACAPI::Favorite::Favorite Class Referencefinal
Favorite Management
Favorite class represents a favorite element in the Archicad Favorite Manager. More...
#include <Favorite.hpp>
 Inheritance diagram for ACAPI::Favorite::Favorite:
 Public Member Functions
bool  | IsValid () const
Result< GS::UniString >  | GetName () const
Result< FavoriteFolder >  | GetParentFolder () const
Result< API_ElemType >  | GetElementType () const
Result< API_Element >  | GetOldElementDefault () const
Result< std::vector< API_SubElement > >  | GetSubElements () const
Result< API_ElementMemo >  | GetMemo () const
Result< API_Element >  | GetElementMarker () const
Result< API_ElementMemo >  | GetMemoMarker () const
Result< ACAPI::ElementDefault >  | GetElementDefault () const
Result< std::vector< API_Property > >  | GetProperties () const
Result< std::vector< GS::Pair< API_Guid, API_Guid > > >  | GetClassifications () const
Result< std::vector< API_ElemCategoryValue > >  | GetElemCategoryValues () const
Result< void >  | GetPreviewImage (API_ImageViewID viewType, NewDisplay::NativeImage &img) const
Get the preview image of the favorite.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Favorite class represents a favorite element in the Archicad Favorite Manager.
Since
Archicad 29
Member Function Documentation
◆ GetClassifications()
 Result< std::vector< GS::Pair< API_Guid, API_Guid > > > ACAPI::Favorite::Favorite::GetClassifications  |  ( |   | ) |   const
Returns
The classifications of the favorite. If the favorite is not valid, an error is returned.
◆ GetElemCategoryValues()
 Result< std::vector< API_ElemCategoryValue > > ACAPI::Favorite::Favorite::GetElemCategoryValues  |  ( |   | ) |   const
Returns
The element category values of the favorite. If the favorite is not valid, an error is returned.
◆ GetElementDefault()
 Result< ACAPI::ElementDefault > ACAPI::Favorite::Favorite::GetElementDefault  |  ( |   | ) |   const
Returns
The ElementDefault of the favorite. If the favorite is not valid, an error is returned.
◆ GetElementMarker()
 Result< API_Element > ACAPI::Favorite::Favorite::GetElementMarker  |  ( |   | ) |   const
Returns
The API_Element of the favorite marker if the element type has a marker element. If the favorite is not valid, an error is returned.
◆ GetElementType()
 Result< API_ElemType > ACAPI::Favorite::Favorite::GetElementType  |  ( |   | ) |   const
Returns
The element type of the favorite. If the favorite is not valid, an error is returned.
◆ GetMemo()
 Result< API_ElementMemo > ACAPI::Favorite::Favorite::GetMemo  |  ( |   | ) |   const
Returns
The API_ElementMemo of the favorite. If the favorite is not valid, an error is returned.
◆ GetMemoMarker()
 Result< API_ElementMemo > ACAPI::Favorite::Favorite::GetMemoMarker  |  ( |   | ) |   const
Returns
The API_ElementMemo of the favorite marker if the element type has a marker element. If the favorite is not valid, an error is returned.
◆ GetName()
 Result< GS::UniString > ACAPI::Favorite::Favorite::GetName  |  ( |   | ) |   const
Returns
The name of the favorite. If the favorite is not valid, an error is returned.
◆ GetOldElementDefault()
 Result< API_Element > ACAPI::Favorite::Favorite::GetOldElementDefault  |  ( |   | ) |   const
Returns
The default of the favorite in API_Element format. If the favorite is not valid, an error is returned.
◆ GetParentFolder()
 Result< FavoriteFolder > ACAPI::Favorite::Favorite::GetParentFolder  |  ( |   | ) |   const
Returns
The parent folder of the favorite. If the favorite is not valid, an error is returned.
◆ GetPreviewImage()
 Result< void > ACAPI::Favorite::Favorite::GetPreviewImage  |  ( |  API_ImageViewID |  viewType,
|  NewDisplay::NativeImage & |  img ) const
Get the preview image of the favorite.
Parameters
viewType | The view type of the preview image. The available view types are defined in APIdefs_Environment.h.
img | The preview image of the favorite.
Returns
Success if the preview image is successfully retrieved, otherwise an error.
◆ GetProperties()
 Result< std::vector< API_Property > > ACAPI::Favorite::Favorite::GetProperties  |  ( |   | ) |   const
Returns
The properties of the favorite. If the favorite is not valid, an error is returned.
◆ GetSubElements()
 Result< std::vector< API_SubElement > > ACAPI::Favorite::Favorite::GetSubElements  |  ( |   | ) |   const
Returns
The subelement defaults of the favorite if the element type has subelements. If the favorite is not valid, an error is returned.
◆ IsValid()
 bool ACAPI::Favorite::Favorite::IsValid  |  ( |   | ) |   const
Returns
True if the Favorite refers to a valid favorite instance, otherwise false.